Infrastructure/Resources/SapProductionOrderTemplate.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <msgID:messageId xmlns:msgID="http://www.sap.com/webas/640/soap/features/messageId/">uuid:00505694-2582-1eee-949a-5011664b41c9</msgID:messageId>
    </soap-env:Header>
    <soap-env:Body>
        <LOIPRO05 xmlns="urn:sap-com:document:sap:idoc:soap:messages">
            <IDOC BEGIN="1">
                <EDI_DC40 SEGMENT="1">
                    <TABNAM>EDI_DC40</TABNAM>
                    <MANDT>200</MANDT>
                    <DOCNUM>0000000064489999</DOCNUM>
                    <DOCREL>756</DOCREL>
                    <STATUS>30</STATUS>
                    <DIRECT>1</DIRECT>
                    <OUTMOD>2</OUTMOD>
                    <IDOCTYP>LOIPRO05</IDOCTYP>
                    <MESTYP>LOIPRO</MESTYP>
                    <SNDPOR>SAPSQ2</SNDPOR>
                    <SNDPRT>LS</SNDPRT>
                    <SNDPRN>SQ2200</SNDPRN>
                    <RCVPOR>HCI_DME</RCVPOR>
                    <RCVPRT>LS</RCVPRT>
                    <RCVPRN>DMETEST</RCVPRN>
                    <CREDAT>20231016</CREDAT>
                    <CRETIM>203913</CRETIM>
                    <ARCKEY>urn:sap.com:msgid=0050569425821EEE949A5011664B41C9</ARCKEY>
                    <SERIAL>20231016183911646107</SERIAL>
                </EDI_DC40>
                <E1AFKOL SEGMENT="1">
                    <AUFNR>ProductionOrderNumber</AUFNR>
                    <APROZ>0.00</APROZ>
                    <AUART>P001</AUART>
                    <AUFLD>20240606</AUFLD>
                    <AUTYP>PP001</AUTYP>
                    <BAUMNG>0.000</BAUMNG>
                    <BMEINS>EA</BMEINS>
                    <BMENGE>1.000</BMENGE>
                    <CY_SEQNR>00000000000000</CY_SEQNR>
                    <DISPO>TKP</DISPO>
                    <FEVOR>TK</FEVOR>
                    <FHORI>000</FHORI>
                    <FREIZ>000</FREIZ>
                    <FTRMI>20240406</FTRMI>
                    <FTRMS>20240606</FTRMS>
                    <GAMNG>TotalOrderQuantity</GAMNG>
                    <GASMG>0.000</GASMG>
                    <GETRI>ConfirmedOrderFinishDate</GETRI>
                    <GEUZI>000000</GEUZI>
                    <GLTRI>00000000</GLTRI>
                    <GLTRP>20240406</GLTRP>
                    <GLTRS>20240606</GLTRS>
                    <GLUZP>000000</GLUZP>
                    <GLUZS>100750</GLUZS>
                    <GMEIN>EA</GMEIN>
                    <GSTRI>ActualStartDate</GSTRI>
                    <GSTRP>20240606</GSTRP>
                    <GSTRS>20240606</GSTRS>
                    <GSUZP>060000</GSUZP>
                    <GSUZS>060000</GSUZS>
                    <IASMG>0.000</IASMG>
                    <IGMNG>0.000</IGMNG>
                    <LODIV>0.000</LODIV>
                    <MATNR>MaterialNumber</MATNR>
                    <MATNR_VERSION>A</MATNR_VERSION>         
                    <PLAUF>00000000</PLAUF>
                    <PLNAL>D</PLNAL>
                    <PLNME>EA</PLNME>
                    <PLNNR>SME_FE</PLNNR>
                    <PLNTY>2</PLNTY>
                    <PLSVB>99999999.000</PLSVB>
                    <PLSVN>0.000</PLSVN>
                    <PSPEL>00000000</PSPEL>
                    <RMNGA>0.000</RMNGA>
                    <SBMEH>EA</SBMEH>
                    <SBMNG>1.000</SBMNG>
                    <SICHZ>000</SICHZ>
                    <SLSBS>0.000</SLSBS>
                    <SLSVN>0.000</SLSVN>
                    <STLAL>1</STLAL>
                    <STLAN>1</STLAN>
                    <STLNR>SMT</STLNR>
                    <BOM_VERSN>A</BOM_VERSN>
                    <TERKZ>4</TERKZ>
                    <VORGZ>000</VORGZ>
                    <WERKS>AUTOMO</WERKS>
                    <PRUEFLOS>30000024686</PRUEFLOS>
                    <STLTY>M</STLTY>
                    <KDPOS>000000</KDPOS>
                    <MATNR_LONG>SEMI</MATNR_LONG>
                    <E1JSTKL SEGMENT="1">
                        <STAT>E0001</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0002</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0016</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0028</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0048</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0115</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0215</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0249</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0281</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0361</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0369</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1JSTKL SEGMENT="1">
                        <STAT>I0420</STAT>
                        <STSMA>ZPP_001</STSMA>
                    </E1JSTKL>
                    <E1AFFLL SEGMENT="1">
                        <APLZL>00000002</APLZL>
                        <AUSCHL>2</AUSCHL>
                        <FLGAT>0</FLGAT>
                        <PLNFL>0</PLNFL>
                        <E1AFVOL SEGMENT="1">
                            <VORNR>0010</VORNR>
                            <ABRUE>0.000000000000000E+00</ABRUE>
                            <ANZZL>0</ANZZL>
                            <ARBEI>0.0</ARBEI>
                            <ARBID>10001259</ARBID>
                            <AUFAK>0.000</AUFAK>
                            <BEARZ>5.652777777777778E-01</BEARZ>
                            <BEAZE>HUR</BEAZE>
                            <BMSCH>1.000</BMSCH>
                            <CY_SEQNRV>00000000000000</CY_SEQNRV>
                            <DAUNE>MIN</DAUNE>
                            <DAUNO>0.0</DAUNO>
                            <DAUMI>0.0</DAUMI>
                            <FSAVD>20231016</FSAVD>
                            <FSAVZ>060000</FSAVZ>
                            <FSEDD>20231016</FSEDD>
                            <FSEDZ>063355</FSEDZ>
                            <FSELD>20231016</FSELD>
                            <FSELZ>063355</FSELZ>
                            <FSEVD>20231016</FSEVD>
                            <FSEVZ>063355</FSEVZ>
                            <FSSAD>20231016</FSSAD>
                            <FSSAZ>063355</FSSAZ>
                            <FSSBD>20231016</FSSBD>
                            <FSSBZ>060000</FSSBZ>
                            <FSSLD>20231016</FSSLD>
                            <FSSLZ>063355</FSSLZ>
                            <KALID>Z2</KALID>
                            <LIEGZ>0.000000000000000E+00</LIEGZ>
                            <LMNGA>0.000</LMNGA>
                            <LTXA1>Pasta Mixing</LTXA1>
                            <MEINH>EA</MEINH>
                            <MINWE>0.000</MINWE>
                            <MGVRG>1000.000</MGVRG>
                            <PEINH>0</PEINH>
                            <PREIS>0.00</PREIS>
                            <PRZNT>0</PRZNT>
                            <RMNGA>0.000</RMNGA>
                            <RUEST>0.000000000000000E+00</RUEST>
                            <SPLIM>0</SPLIM>
                            <SSAVD>20231016</SSAVD>
                            <SSAVZ>060000</SSAVZ>
                            <SSEDD>20231016</SSEDD>
                            <SSEDZ>063355</SSEDZ>
                            <SSELD>20231016</SSELD>
                            <SSELZ>063355</SSELZ>
                            <SSEVD>20231016</SSEVD>
                            <SSEVZ>063355</SSEVZ>
                            <SSSAD>20231016</SSSAD>
                            <SSSAZ>063355</SSSAZ>
                            <SSSBD>20231016</SSSBD>
                            <SSSBZ>060000</SSSBZ>
                            <SSSLD>20231016</SSSLD>
                            <SSSLZ>063355</SSSLZ>
                            <STEUS>PI01</STEUS>
                            <TRANZ>0.000000000000000E+00</TRANZ>
                            <USR04>0.000</USR04>
                            <USR05>0.000</USR05>
                            <WARTZ>0.000000000000000E+00</WARTZ>
                            <XMNGA>0.000</XMNGA>
                            <ZLPRO>0.000</ZLPRO>
                            <ZMINB>0.000</ZMINB>
                            <ZMINU>0.000</ZMINU>
                            <ZTMIN>0.000</ZTMIN>
                            <ZWMIN>0.000</ZWMIN>
                            <ZWNOR>0.000</ZWNOR>
                            <ISAVD>00000000</ISAVD>
                            <IEAVD>00000000</IEAVD>
                            <ISDD>00000000</ISDD>
                            <ISDZ>000000</ISDZ>
                            <IEDD>00000000</IEDD>
                            <IEDZ>000000</IEDZ>
                            <ANZMA>0.00</ANZMA>
                            <SAMPLE_SIZE>0.000</SAMPLE_SIZE>
                            <ARBPL>SMT</ARBPL>
                            <RUEK>0</RUEK>
                            <SAMPLE_SIZE_ALL>0.000</SAMPLE_SIZE_ALL>
                            <E1AFVOL2 SEGMENT="1">
                                <USR08>00000000</USR08>
                                <USR09>00000000</USR09>
                                <PAR01_LTXT>Setup</PAR01_LTXT>
                                <PAR02_LTXT>Production</PAR02_LTXT>
                                <PAR03_LTXT>Stop</PAR03_LTXT>
                                <TERM>X</TERM>
                                <KAPA>X</KAPA>
                                <AUFPL>0000184912</AUFPL>
                                <APLZL>00000016</APLZL>
                            </E1AFVOL2>
                            <E1JSTVL SEGMENT="1">
                                <STAT>I0002</STAT>
                            </E1JSTVL>
                            <E1KBEDL SEGMENT="1">
                                <BEDID>010007640578</BEDID>
                                <BEDZL>00000004</BEDZL>
                                <CANUM>0512</CANUM>
                                <KABRREST>0.000000000000000E+00</KABRREST>
                                <KABRSOLL>0.000000000000000E+00</KABRSOLL>
                                <KAPAR>008</KAPAR>
                                <KAPID>10000869</KAPID>
                                <KBEAREST>0.000000000000000E+00</KBEAREST>
                                <KBEASOLL>0.000000000000000E+00</KBEASOLL>
                                <KRUEREST>0.000000000000000E+00</KRUEREST>
                                <KRUESOLL>0.000000000000000E+00</KRUESOLL>
                                <ARBID>10001259</ARBID>
                                <FSTAD>20231016</FSTAD>
                                <FSTAU>060000</FSTAU>
                                <FENDD>20231016</FENDD>
                                <FENDU>063355</FENDU>
                                <SPLIT>0</SPLIT>
                                <MGVRG>1000.000</MGVRG>
                                <MEINH>EA</MEINH>
                            </E1KBEDL>
                        </E1AFVOL>
                        <E1AFVOL SEGMENT="1">
                            <VORNR>0012</VORNR>
                            <PVZNR>0010</PVZNR>
                            <ABRUE>0.000000000000000E+00</ABRUE>
                            <ANZZL>0</ANZZL>
                            <ARBEI>0.0</ARBEI>
                            <ARBID>10001259</ARBID>
                            <AUFAK>0.000</AUFAK>
                            <BEARZ>5.652777777777778E-01</BEARZ>
                            <BEAZE>HUR</BEAZE>
                            <BMSCH>42453.000</BMSCH>
                            <CY_SEQNRV>00000000000000</CY_SEQNRV>
                            <DAUNE>MIN</DAUNE>
                            <DAUNO>0.0</DAUNO>
                            <DAUMI>0.0</DAUMI>
                            <FSAVD>20231016</FSAVD>
                            <FSAVZ>060000</FSAVZ>
                            <FSEDD>20231016</FSEDD>
                            <FSEDZ>063355</FSEDZ>
                            <FSELD>20231016</FSELD>
                            <FSELZ>063355</FSELZ>
                            <FSEVD>20231016</FSEVD>
                            <FSEVZ>063355</FSEVZ>
                            <FSSAD>20231016</FSSAD>
                            <FSSAZ>063355</FSSAZ>
                            <FSSBD>20231016</FSSBD>
                            <FSSBZ>060000</FSSBZ>
                            <FSSLD>20231016</FSSLD>
                            <FSSLZ>063355</FSSLZ>
                            <KALID>Z2</KALID>
                            <LAR01>920</LAR01>
                            <LAR02>913</LAR02>
                            <LAR03>913</LAR03>
                            <LIEGZ>0.000000000000000E+00</LIEGZ>
                            <LMNGA>0.000</LMNGA>
                            <LTXA1>Setup</LTXA1>
                            <MEINH>EA</MEINH>
                            <MINWE>0.000</MINWE>
                            <MGVRG>1000.000</MGVRG>
                            <PEINH>0</PEINH>
                            <PREIS>0.00</PREIS>
                            <PRZNT>0</PRZNT>
                            <RMNGA>0.000</RMNGA>
                            <RUEST>0.000000000000000E+00</RUEST>
                            <SPLIM>0</SPLIM>
                            <SSAVD>20231016</SSAVD>
                            <SSAVZ>060000</SSAVZ>
                            <SSEDD>20231016</SSEDD>
                            <SSEDZ>063355</SSEDZ>
                            <SSELD>20231016</SSELD>
                            <SSELZ>063355</SSELZ>
                            <SSEVD>20231016</SSEVD>
                            <SSEVZ>063355</SSEVZ>
                            <SSSAD>20231016</SSSAD>
                            <SSSAZ>063355</SSSAZ>
                            <SSSBD>20231016</SSSBD>
                            <SSSBZ>060000</SSSBZ>
                            <SSSLD>20231016</SSSLD>
                            <SSSLZ>063355</SSSLZ>
                            <STEUS>PI01</STEUS>
                            <TRANZ>0.000000000000000E+00</TRANZ>
                            <USR04>0.000</USR04>
                            <USR05>0.000</USR05>
                            <VGE01>HUR</VGE01>
                            <VGE02>HUR</VGE02>
                            <VGE03>HUR</VGE03>
                            <WARTZ>0.000000000000000E+00</WARTZ>
                            <XMNGA>0.000</XMNGA>
                            <ZLPRO>0.000</ZLPRO>
                            <ZMINB>0.000</ZMINB>
                            <ZMINU>0.000</ZMINU>
                            <ZTMIN>0.000</ZTMIN>
                            <ZWMIN>0.000</ZWMIN>
                            <ZWNOR>0.000</ZWNOR>
                            <ISAVD>00000000</ISAVD>
                            <IEAVD>00000000</IEAVD>
                            <ISDD>00000000</ISDD>
                            <ISDZ>000000</ISDZ>
                            <IEDD>00000000</IEDD>
                            <IEDZ>000000</IEDZ>
                            <ANZMA>0.00</ANZMA>
                            <SAMPLE_SIZE>1.000</SAMPLE_SIZE>
                            <INSPLOT_BASE_UOM>EA</INSPLOT_BASE_UOM>
                            <ARBPL>SMT</ARBPL>
                            <RUEK>0</RUEK>
                            <SAMPLE_SIZE_ALL>1.000</SAMPLE_SIZE_ALL>
                            <E1AFVOL2 SEGMENT="1">
                                <USR08>00000000</USR08>
                                <USR09>00000000</USR09>
                                <PAR01_LTXT>Setup</PAR01_LTXT>
                                <PAR02_LTXT>Production</PAR02_LTXT>
                                <PAR03_LTXT>Stop</PAR03_LTXT>
                                <TERM>X</TERM>
                                <KAPA>X</KAPA>
                                <AUFPL>0000184912</AUFPL>
                                <APLZL>00000017</APLZL>
                            </E1AFVOL2>
                            <E1JSTVL SEGMENT="1">
                                <STAT>I0002</STAT>
                            </E1JSTVL>
                           
                        </E1AFVOL>
                    </E1AFFLL>
                </E1AFKOL>
            </IDOC>
        </LOIPRO05>
    </soap-env:Body>
</soap-env:Envelope>